# B5 final: keep the original B2 top-down P3 fusion path and add MDHIFI
# on both P3 and P4 lateral branches:
# P3 lateral -> MDHIFI -> P3m
# P3m -> Down(A4) -> inject into P4 concat
# P4 lateral (Y4) -> MDHIFI -> P4m -> Down(A5) -> inject into P5 concat

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12, Y5, lateral_convs.0

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.1
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 14 P4 lateral enhancement/P4m
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[11, -1], 1, Concat, [1]] # 16 cat Up(Y5) + P4m
  - [-1, 3, RepC3, [256]] # 16, fpn_blocks.0
  # - [-1, 1, Conv, [256, 1, 1]] # 17, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 20 input_proj.0
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 21 P3 lateral enhancement/P3m
  - [[19, 21], 1, Concat, [1]] # 22 cat Up(Y4) + P3m
  - [-1, 3, RepC3, [256]] # 23, P3_out, keep the original B2 top-down path

  - [21, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 24 A4: Down(P3m) -> P4 scale
  - [[-1, 17], 1, Concat, [1]] # 25 cat A4 + Y4
  - [-1, 3, RepC3, [256]] # 26, P4_out, pan_blocks.0

  - [18, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 27 A5: Down(P4m) -> P5 scale
  - [26, 1, Conv, [256, 3, 2]] # 28, downsample_convs.1
  - [[-1, 12, 27], 1, Concat, [1]] # 29 cat Down(P4_out) + Y5 + A5
  - [-1, 3, RepC3, [256]] # 30, P5_out, pan_blocks.1

  - [[23, 26, 30], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
