# B5 variant: corrected B5 topology, but remove the P4-stage MDHIFI.
# P4 input_proj.1 -> top-down P4 fusion
# P3 lateral -> MDHIFI -> P3m -> P3_out
# P3m -> Down(A4) -> inject into P4 concat
# Y4 -> Down(A5) -> inject into P5 concat

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 Up(Y5)
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 15 cat Up(Y5) + P4
  - [-1, 3, RepC3, [256]] # 16 top-down P4 feature
  - [-1, 1, Conv, [256, 1, 1]] # 17 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18 Up(Y4)
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19 input_proj.0
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 20 P3 enhancement/P3m
  - [[18, 20], 1, Concat, [1]] # 21 cat Up(Y4) + P3m
  - [-1, 3, RepC3, [256]] # 22 P3_out

  - [20, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 23 A4: Down(P3m) -> P4 scale
  - [[-1, 17], 1, Concat, [1]] # 24 cat A4 + Y4
  - [-1, 3, RepC3, [256]] # 25 P4_out

  - [17, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 26 A5: Down(Y4) -> P5 scale
  - [25, 1, Conv, [256, 3, 2]] # 27 Down(P4_out)
  - [[-1, 12, 26], 1, Concat, [1]] # 28 cat Down(P4_out) + Y5 + A5
  - [-1, 3, RepC3, [256]] # 29 P5_out

  - [[22, 25, 29], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
