# B6: B5基础上移除P2的EMA（P2直接使用Permute输出，不经attention）
# P5仍保留为AIFI语义源和HFSCC校准源
# P5 -> AIFI -> Y5 -> HFSCC(P3m, P4m, Y5) -> P3c,P4c,P5c
# Decoder仅接收P2_out, P3_out, P4_out

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention
  - [0, 1, Index, [96, 1]] # 10 stage1 -> P2/4 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 11 P2 -> NCHW (no EMA, directly to head)

head:
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 P5 proj
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]] # 14 Y5

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 P4 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 16 P4m

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 P3 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 18 P3m

  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19 P2 proj (96->256, no MDHIFI)

  - [[18, 16, 14], 1, HFSCC, [4, 3, "shift", True]] # 20 -> P3c, P4c, P5c
  - [20, 1, Index, [256, 0]] # 21 P3c
  - [20, 1, Index, [256, 1]] # 22 P4c
  - [20, 1, Index, [256, 2]] # 23 P5c

  # FPN (top-down)
  - [23, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [[-1, 22], 1, Concat, [1]] # 25 P5c_up + P4c
  - [-1, 3, RepC3, [256]] # 26 Y4
  - [-1, 1, Conv, [256, 1, 1]] # 27 Y4_proj

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[-1, 21], 1, Concat, [1]] # 29 Y4_up + P3c
  - [-1, 3, RepC3, [256]] # 30 Y3
  - [-1, 1, Conv, [256, 1, 1]] # 31 Y3_proj

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 32
  - [[-1, 19], 1, Concat, [1]] # 33 Y3_up + P2 (proj only, no MDHIFI)
  - [-1, 3, RepC3, [256]] # 34 P2_out

  # PAN (bottom-up) — P3c/P4c 重复注入保留
  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 35 P2_out stride2
  - [[-1, 31, 21], 1, Concat, [1]] # 36 P2_down + Y3_proj + P3c
  - [-1, 3, RepC3, [256]] # 37 P3_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 38 P3_out stride2
  - [[-1, 27, 22], 1, Concat, [1]] # 39 P3_down + Y4_proj + P4c
  - [-1, 3, RepC3, [256]] # 40 P4_out

  # P5检测头移除: decoder仅使用P2/P3/P4
  # P5仍通过AIFI(#13)提供语义信息，通过HFSCC(#20)提供校准信息

  - [[34, 37, 40], 1, RTDETRDecoder, [nc]] # 41 Detect(P2_out, P3_out, P4_out)
