# Experiment 3 (0630): Dual MDHIFI, dual upsample, with HFSCC noise suppression.
# Ablation: 双mdhifi双upsample，含噪声抑制
# This is the full B7 baseline — identical architecture to detr0628/b6-p3p4-hfscc.
#
# Architecture:
#   P5 proj → AIFI → Y5
#   P4 proj → MDHIFI → P4m
#   P3 proj → MDHIFI → P3m
#   HFSCC([P3m, P4m, Y5]) → [P3c, P4c, P5c]   (noise suppression ON)
#   P5c --Up--> Concat(P4c) → RepC3 → Y4 proj   (P4 upsample)
#   Y4 --Up--> Concat(P3c) → RepC3 → P3_out     (P3 upsample)
#   P3_out --Down--> Concat(Y4_proj, P4c) → P4_out
#   P4_out --Down--> Concat(P5c) → P5_out

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 P5 proj
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12 Y5

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 P4 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 14 P4m

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 P3 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 16 P3m

  - [[16, 14, 12], 1, HFSCC, [4, 3, "shift", True]] # 17 -> P3c, P4c, P5c
  - [17, 1, Index, [256, 0]] # 18 P3c
  - [17, 1, Index, [256, 1]] # 19 P4c
  - [17, 1, Index, [256, 2]] # 20 P5c

  # P4 upsample: P5c → Up → Concat(P4c) → Y4
  - [20, 1, nn.Upsample, [None, 2, "nearest"]] # 21 Up(P5c)
  - [[-1, 19], 1, Concat, [1]] # 22 cat Up(P5c) + P4c
  - [-1, 3, RepC3, [256]] # 23 Y4
  - [-1, 1, Conv, [256, 1, 1]] # 24 Y4 proj

  # P3 upsample: Y4 → Up → Concat(P3c) → P3_out
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25 Up(Y4)
  - [[-1, 18], 1, Concat, [1]] # 26 cat Up(Y4) + P3c
  - [-1, 3, RepC3, [256]] # 27 P3_out

  # Bottom-up: P3_out → Down → Concat(Y4_proj, P4c) → P4_out
  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 28 Down(P3_out)
  - [[-1, 24, 19], 1, Concat, [1]] # 29 cat Down(P3_out) + Y4_proj + P4c
  - [-1, 3, RepC3, [256]] # 30 P4_out

  # Bottom-up: P4_out → Down → Concat(P5c) → P5_out
  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 31 Down(P4_out)
  - [[-1, 20], 1, Concat, [1]] # 32 cat Down(P4_out) + P5c
  - [-1, 3, RepC3, [256]] # 33 P5_out

  - [[27, 30, 33], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
