# Ultralytics RT-DETR with a torchvision ResNet101 backbone using ImageNet pretrained weights.
# This variant keeps EMA on P3/P4/P5 and swaps the neck to BiAGCAU + WTConv while inserting MDHIFI after AIFI.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 2048]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [2048, resnet101, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [512, 6]] # 1 layer2 -> P3/8
  - [-1, 1, EMA, [512]] # 2 P3 attention
  - [0, 1, Index, [1024, 7]] # 3 layer3 -> P4/16
  - [-1, 1, EMA, [1024]] # 4 P4 attention
  - [0, 1, Index, [2048, 8]] # 5 layer4 -> P5/32
  - [-1, 1, EMA, [2048]] # 6 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 7 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 8
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 9
  - [-1, 1, Conv, [256, 1, 1]] # 10, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 13 cat backbone P4
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 14, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 15, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 18 cat backbone P3
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 19, fpn_blocks.1

  - [-1, 1, DynamicWTConv2d, [256, 5, 2]] # 20, downsample_convs.0
  - [[-1, 15], 1, Concat, [1]] # 21 cat Y4
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 22, pan_blocks.0

  - [-1, 1, DynamicWTConv2d, [256, 5, 2]] # 23, downsample_convs.1
  - [[-1, 10], 1, Concat, [1]] # 24 cat Y5
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 25, pan_blocks.1

  - [[19, 22, 25], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
