# Ultralytics YOLO 🚀, AGPL-3.0 license
# EMA-enhanced RT-DETR P2 variant derived from the current exp_cfg/detr/rtdetr-MRFPN.yaml layout.

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, EMA, [64]] # 5-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 6
  - [-1, 1, EMA, [128]] # 7-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 8
  - [-1, 1, EMA, [256]] # 9-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 10
  - [-1, 1, EMA, [512]] # 11-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]]  # 14, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 16 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 17
  - [-1, 3, RepC3, [256, 0.5]]  # 18, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 19, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 21 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 22 cat backbone P3
  - [-1, 3, RepC3, [256, 0.5]]    # 23

  - [-1, 1, Conv, [256, 3, 2]]   # 24, downsample_convs.0
  - [[-1, 19], 1, Concat, [1]]  # 25 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # 26

  - [-1, 1, Conv, [256, 3, 2]]   # 27, downsample_convs.1
  - [[-1, 14], 1, Concat, [1]]  # 28 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # 29

  - [[20, 22, 24, 26], 1, RTDETRDecoder, [nc, 128, 300, 4, 8, 3]] # Detect(P2, P3, P4, P5)
