# SwinV2-Tiny RT-DETR baseline with EMA on P3/P4/P5 and MDHIFI inserted after AIFI on the P5 branch.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 12 B1: deep semantic enhancement after AIFI
  - [-1, 1, Conv, [256, 1, 1]] # 13, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 16 cat backbone P4
  - [-1, 3, RepC3, [256]] # 17, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 18, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 20 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 21 cat backbone P3
  - [-1, 3, RepC3, [256]] # 22, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 23, downsample_convs.0
  - [[-1, 18], 1, Concat, [1]] # 24 cat Y4
  - [-1, 3, RepC3, [256]] # 25, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 26, downsample_convs.1
  - [[-1, 13], 1, Concat, [1]] # 27 cat Y5
  - [-1, 3, RepC3, [256]] # 28, pan_blocks.1

  - [[22, 25, 28], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
