# 0619 B3: SwinV2-Tiny RT-DETR with EMA, P3-MDHIFI, and BiAGCAU at all four neck fusion nodes.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 15 cat backbone P4
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 16, replaces fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 17, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19 input_proj.0
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 20 P3 lateral enhancement
  - [[-2, -1], 1, Concat, [1]] # 21 cat backbone P3m
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 22, replaces fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 23, downsample_convs.0
  - [[-1, 17], 1, Concat, [1]] # 24 cat Y4
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 25, replaces pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 26, downsample_convs.1
  - [[-1, 12], 1, Concat, [1]] # 27 cat Y5
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 28, replaces pan_blocks.1

  - [[22, 25, 28], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
