# B2-derived SwinV2-Tiny RT-DETR with EMA.
# Both P3 and P4 insert MDHIFI immediately after their 1x1 lateral convs:
# P4: Y4 -> MDHIFI -> P4m
# P3: input_proj.0 -> MDHIFI -> P3m
# This direct-P3 sibling keeps "no upsample to P3" and uses:
# P3m -> RepC3 -> P3_out
# Down(P3m) + P4m -> RepC3 -> P4_out
# Down(P4m) + Y5 -> RepC3 -> P5_out

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 15 cat backbone P4
  - [-1, 3, RepC3, [256]] # 16, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 17, Y4, lateral_convs.1
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 18 P4 lateral enhancement/P4m

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19 input_proj.0
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 20 P3 lateral enhancement/P3m
  - [-1, 3, RepC3, [256]] # 21, P3_out, direct RepC3 on P3m without Up(Y4)

  - [20, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 22 plain Down(P3m) -> P4 scale
  - [[-1, 18], 1, Concat, [1]] # 23 cat Down(P3m) + P4m
  - [-1, 3, RepC3, [256]] # 24, P4_out, pan_blocks.0

  - [18, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 25 plain Down(P4m) -> P5 scale
  - [[-1, 12], 1, Concat, [1]] # 26 cat Down(P4m) + Y5
  - [-1, 3, RepC3, [256]] # 27, P5_out, pan_blocks.1

  - [[21, 24, 27], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
