# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with MRFPN head and EMA-enhanced backbone.

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, EMA, [64]] # 5-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 6
  - [-1, 1, EMA, [128]] # 7-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 8
  - [-1, 1, EMA, [256]] # 9-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 10
  - [-1, 1, EMA, [512]] # 11-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]]  # 14, Y5, lateral_convs.0

  - [[-1, 9], 1, MCAM, []] # 15
  - [-1, 3, RepC3, [256, 0.5]] # 16

  - [[-1, 7], 1, MCAM, []] # 17
  - [-1, 3, RepC3, [256, 0.5]] # 18

  - [[-1, 5], 1, MCAM, []] # 19
  - [-1, 3, RepC3, [128, 0.5]] # 20

  - [[-1, 18], 1, MCAM, []] # 21
  - [-1, 3, RepC3, [256, 0.5]] # 22

  - [[-1, 16], 1, MCAM, []] # 23
  - [-1, 3, RepC3, [256, 0.5]] # 24

  - [[-1, 14], 1, MCAM, []] # 25
  - [-1, 3, RepC3, [256, 0.5]] # 26

  - [[20, 22, 24, 26], 1, RTDETRDecoder, [nc, 128, 300, 4, 8, 3]]  # Detect(P2, P3, P4, P5)
