# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l with EMA backbone, bidirectional AGCAU, and MDHIFI for Exp3(A+B+C)

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, EMA, [64]] # 5-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 6
  - [-1, 1, EMA, [128]] # 7-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 8
  - [-1, 1, EMA, [256]] # 9-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 10
  - [-1, 1, EMA, [512]] # 11-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 14
  - [-1, 1, Conv, [256, 1, 1]] # 15, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 18
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 19, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 20, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 22 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 23
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 24, X3

  - [-1, 1, DynamicWTConv2d, [256, 5, 2]] # 25, downsample_convs.0
  - [[-1, 20], 1, Concat, [1]] # 26
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 27, F4

  - [-1, 1, DynamicWTConv2d, [256, 5, 2]] # 28, downsample_convs.1
  - [[-1, 15], 1, Concat, [1]] # 29
  - [-1, 3, BiAGCAUBlock, [256, 0.5]] # 30, F5

  - [[24, 27, 30], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
