# Ultralytics RT-DETR with a torchvision Swin Transformer V2 Tiny backbone using ImageNet pretrained weights.
# The detector consumes the last three backbone stages (P3/P4/P5) after permuting NHWC features to NCHW.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [0, 1, Index, [384, 5]] # 3 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 4 P4 -> NCHW
  - [0, 1, Index, [768, 7]] # 5 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 6 P5 -> NCHW

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 7 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 8
  - [-1, 1, Conv, [256, 1, 1]] # 9, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 3, RepC3, [256]] # 13, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 14, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 16 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 17 cat backbone P3
  - [-1, 3, RepC3, [256]] # 18, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 19, downsample_convs.0
  - [[-1, 14], 1, Concat, [1]] # 20 cat Y4
  - [-1, 3, RepC3, [256]] # 21, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 22, downsample_convs.1
  - [[-1, 9], 1, Concat, [1]] # 23 cat Y5
  - [-1, 3, RepC3, [256]] # 24, pan_blocks.1

  - [[18, 21, 24], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
