# B2-derived SwinV2-Tiny RT-DETR with EMA and P3-MDHIFI.
# The diagram's bottom-up PAN branch uses plain 3x3 stride-2 Conv transitions:
# Y3 -> Down(Y3) -> Concat(Y4) -> Z4 -> Down(Z4) -> Concat(Y5) -> Z5.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 15 cat backbone P4
  - [-1, 3, RepC3, [256]] # 16, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 17, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19 input_proj.0
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 20 B2: P3 lateral enhancement
  - [[18, 20], 1, Concat, [1]] # 21 cat Up(Y4) + P3m
  - [-1, 3, RepC3, [256]] # 22, Y3/P3_out, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 23, Down(Y3)
  - [[-1, 17], 1, Concat, [1]] # 24 cat Y4
  - [-1, 3, RepC3, [256]] # 25, Z4/P4_out, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 26, Down(Z4)
  - [[-1, 12], 1, Concat, [1]] # 27 cat Y5
  - [-1, 3, RepC3, [256]] # 28, Z5/P5_out, pan_blocks.1

  - [[22, 25, 28], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
