# Ultralytics RT-DETR with a torchvision ResNet101 backbone using ImageNet pretrained weights.
# The detector consumes the last three backbone stages and inserts EMA modules on P3/P4/P5 features.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 2048]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [2048, resnet101, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [512, 6]] # 1 layer2 -> P3/8
  - [-1, 1, EMA, [512]] # 2 P3 attention
  - [0, 1, Index, [1024, 7]] # 3 layer3 -> P4/16
  - [-1, 1, EMA, [1024]] # 4 P4 attention
  - [0, 1, Index, [2048, 8]] # 5 layer4 -> P5/32
  - [-1, 1, EMA, [2048]] # 6 P5 attention

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 7 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 8
  - [-1, 1, Conv, [256, 1, 1]] # 9, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 3, RepC3, [256]] # 13, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 14, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 16 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 17 cat backbone P3
  - [-1, 3, RepC3, [256]] # 18, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 19, downsample_convs.0
  - [[-1, 14], 1, Concat, [1]] # 20 cat Y4
  - [-1, 3, RepC3, [256]] # 21, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 22, downsample_convs.1
  - [[-1, 9], 1, Concat, [1]] # 23 cat Y5
  - [-1, 3, RepC3, [256]] # 24, pan_blocks.1

  - [[18, 21, 24], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
