# SwinV2-Tiny RT-DETR variant with MDHIFI on P3/P4 lateral branches and
# HFSCC cross-scale calibration before the final top-down/bottom-up fusion.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 P5 proj
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12 Y5

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 P4 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 14 P4m

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 P3 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 16 P3m

  - [[16, 14, 12], 1, HFSCC, [4, 3, "shift", True]] # 17 -> P3c, P4c, P5c
  - [17, 1, Index, [256, 0]] # 18 P3c
  - [17, 1, Index, [256, 1]] # 19 P4c
  - [17, 1, Index, [256, 2]] # 20 P5c

  - [20, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  - [[-1, 19], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [256]] # 23 Y4
  - [-1, 1, Conv, [256, 1, 1]] # 24 Y4 proj

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 18], 1, Concat, [1]] # 26
  - [-1, 3, RepC3, [256]] # 27 P3_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 28
  - [[-1, 24, 19], 1, Concat, [1]] # 29
  - [-1, 3, RepC3, [256]] # 30 P4_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 31
  - [[-1, 20], 1, Concat, [1]] # 32
  - [-1, 3, RepC3, [256]] # 33 P5_out

  - [[27, 30, 33], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
