# SwinV2-Tiny RT-DETR variant with P2 output head, MDHIFI on P2/P3/P4 lateral
# branches, and HFSCC cross-scale calibration for P3/P4/P5 before the final
# top-down/bottom-up fusion.
# B2: B0基础上，增加P2输出头（stride 4, 96ch → 256ch proj → MDHIFI）

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention
  - [0, 1, Index, [96, 1]] # 10 stage1 -> P2/4 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 11 P2 -> NCHW
  - [-1, 1, EMA, [96]] # 12 P2 attention

head:
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 P5 proj
  - [-1, 1, AIFI, [1024, 8]] # 14
  - [-1, 1, Conv, [256, 1, 1]] # 15 Y5

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 16 P4 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 17 P4m

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 18 P3 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 19 P3m

  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 20 P2 proj (96->256)
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 21 P2m

  - [[19, 17, 15], 1, HFSCC, [4, 3, "shift", True]] # 22 -> P3c, P4c, P5c
  - [22, 1, Index, [256, 0]] # 23 P3c
  - [22, 1, Index, [256, 1]] # 24 P4c
  - [22, 1, Index, [256, 2]] # 25 P5c

  # FPN (top-down)
  - [25, 1, nn.Upsample, [None, 2, "nearest"]] # 26
  - [[-1, 24], 1, Concat, [1]] # 27 P5c_up + P4c
  - [-1, 3, RepC3, [256]] # 28 Y4
  - [-1, 1, Conv, [256, 1, 1]] # 29 Y4_proj

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 30
  - [[-1, 23], 1, Concat, [1]] # 31 Y4_up + P3c
  - [-1, 3, RepC3, [256]] # 32 Y3
  - [-1, 1, Conv, [256, 1, 1]] # 33 Y3_proj

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 34
  - [[-1, 21], 1, Concat, [1]] # 35 Y3_up + P2m
  - [-1, 3, RepC3, [256]] # 36 P2_out

  # PAN (bottom-up)
  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 37 P2_out stride2
  - [[-1, 33, 23], 1, Concat, [1]] # 38 P2_down + Y3_proj + P3c
  - [-1, 3, RepC3, [256]] # 39 P3_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 40 P3_out stride2
  - [[-1, 29, 24], 1, Concat, [1]] # 41 P3_down + Y4_proj + P4c
  - [-1, 3, RepC3, [256]] # 42 P4_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 43 P4_out stride2
  - [[-1, 25], 1, Concat, [1]] # 44 P4_down + P5c
  - [-1, 3, RepC3, [256]] # 45 P5_out

  - [[36, 39, 42, 45], 1, RTDETRDecoder, [nc]] # 46 Detect(P2_out, P3_out, P4_out, P5_out)
