# Ultralytics RT-DETR with a torchvision ResNet50 backbone using ImageNet pretrained weights.
# The detector consumes the last three backbone stages (layer2/layer3/layer4 => P3/P4/P5).

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [2048, resnet50, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [512, 6]] # 1 layer2 -> P3/8
  - [0, 1, Index, [1024, 7]] # 2 layer3 -> P4/16
  - [0, 1, Index, [2048, 8]] # 3 layer4 -> P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 4 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 5
  - [-1, 1, Conv, [256, 1, 1]] # 6, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 7
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 9 cat backbone P4
  - [-1, 3, RepC3, [256]] # 10, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 11, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 3, RepC3, [256]] # 15, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 16, downsample_convs.0
  - [[-1, 11], 1, Concat, [1]] # 17 cat Y4
  - [-1, 3, RepC3, [256]] # 18, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 19, downsample_convs.1
  - [[-1, 6], 1, Concat, [1]] # 20 cat Y5
  - [-1, 3, RepC3, [256]] # 21, pan_blocks.1

  - [[15, 18, 21], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
