# SwinV2-Tiny RT-DETR variant derived from detr0627/test00003:
# keep MDHIFI on the P3 branch only, then apply HFSCC before final fusion.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_v2_t, DEFAULT, True, 2, True]] # 0 torchvision backbone, split outputs enabled
  - [0, 1, Index, [192, 3]] # 1 stage2 -> P3/8 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 2 P3 -> NCHW
  - [-1, 1, EMA, [192]] # 3 P3 attention
  - [0, 1, Index, [384, 5]] # 4 stage3 -> P4/16 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 5 P4 -> NCHW
  - [-1, 1, EMA, [384]] # 6 P4 attention
  - [0, 1, Index, [768, 7]] # 7 stage4 -> P5/32 (NHWC)
  - [-1, 1, Permute, [0, 3, 1, 2]] # 8 P5 -> NCHW
  - [-1, 1, EMA, [768]] # 9 P5 attention

head:
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 P5 proj
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12 Y5

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 P4 proj

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 P3 proj
  - [-1, 1, MDHIFI, [2048, 8, 3, 5, 4]] # 15 P3m

  - [[15, 13, 12], 1, HFSCC, [4, 3, "shift", True]] # 16 -> P3c, P4c, P5c
  - [16, 1, Index, [256, 0]] # 17 P3c
  - [16, 1, Index, [256, 1]] # 18 P4c
  - [16, 1, Index, [256, 2]] # 19 P5c

  - [19, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 18], 1, Concat, [1]] # 21
  - [-1, 3, RepC3, [256]] # 22 Y4
  - [-1, 1, Conv, [256, 1, 1]] # 23 Y4 proj

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [[-1, 17], 1, Concat, [1]] # 25
  - [-1, 3, RepC3, [256]] # 26 P3_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 27
  - [[-1, 23, 18], 1, Concat, [1]] # 28
  - [-1, 3, RepC3, [256]] # 29 P4_out

  - [-1, 1, Conv, [256, 3, 2, None, 1, 1, False]] # 30
  - [[-1, 19], 1, Concat, [1]] # 31
  - [-1, 3, RepC3, [256]] # 32 P5_out

  - [[26, 29, 32], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
